Revit 2027 API
SymbolicCurveArray.Insert Method
Insert the specified model curve into the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	SymbolicCurve item,
	int index
)
Public Overridable Sub Insert (
	item As SymbolicCurve,
	index As Integer
)
public:
virtual void Insert(
	SymbolicCurve^ item,
	int index
)
abstract Insert :
        item : SymbolicCurve *
        index : int -> unit
override Insert :
        item : SymbolicCurve *
        index : int -> unit
Parameters
item SymbolicCurve
The model curve to be inserted into the array.
index Int32
The model curve will be inserted before this index.
Return Value
Returns whether the model curve was inserted into the array.
See Also
Reference
SymbolicCurveArray Class
Autodesk.Revit.DB Namespace